Revit 2023 API
FabricationPart.CanAdjustEndLength Method
 Checks if the end of fabrication part can be adjusted.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Since: 2017
Syntax
C#
public bool CanAdjustEndLength(
	Connector partConn
)
Visual Basic
Public Function CanAdjustEndLength ( _
	partConn As Connector _
) As Boolean
Visual C++
public:
bool CanAdjustEndLength(
	Connector^ partConn
)
Parameters
partConn
Type: Autodesk.Revit.DB.Connector
 # The connector of the fabrication part to adjust length.
Return Value
 True if the end of fabrication part can be adjusted.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
FabricationPart Class
Autodesk.Revit.DB Namespace